Show / Hide Table of Contents
Enum CountryCode
CountryCode
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum CountryCode
Fields
 Name |  Description
 American
American design code as ACI, AISC, ASTM standards etc.
 Australia
Australian design code
 Canada
Canadian design code
 ECEN
Eurocode
 HKG
Hong Kong design code
 CHN
China design code
 India
India code
 None
no code
 RUS
Russia design code
 SIA
Swiss code
 Improve this Doc
 View Source